Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00_secure/src/packs/PIC32CM5112SG00100_DFP/component/oscctrl.h
#define OSCCTRL_INTENSET_XOSCRDY_Pos          _UINT32_(0)                                          /* (OSCCTRL_INTENSET) XOSC Ready Interrupt Enable Position */
#define OSCCTRL_INTENSET_XOSCRDY_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_XOSCRDY_Pos)      /* (OSCCTRL_INTENSET) XOSC Ready Interrupt Enable Mask */
#define OSCCTRL_INTENSET_XOSCRDY(value)       (OSCCTRL_INTENSET_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_XOSCRDY_Pos)) /* Assignment of value for XOSCRDY in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_XOSCFAIL_Pos         _UINT32_(1)                                          /* (OSCCTRL_INTENSET) XOSC Startup Failure Interrupt Enable Position */
#define OSCCTRL_INTENSET_XOSCFAIL_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_XOSCFAIL_Pos)     /* (OSCCTRL_INTENSET) XOSC Startup Failure Interrupt Enable Mask */
#define OSCCTRL_INTENSET_XOSCFAIL(value)      (OSCCTRL_INTENSET_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_XOSCFAIL_Pos)) /* Assignment of value for XOSCFAIL in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_CLKFAIL_Pos          _UINT32_(2)                                          /* (OSCCTRL_INTENSET) XOSC Clock Failure Interrupt Enable Position */
#define OSCCTRL_INTENSET_CLKFAIL_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_CLKFAIL_Pos)      /* (OSCCTRL_INTENSET) XOSC Clock Failure Interrupt Enable Mask */
#define OSCCTRL_INTENSET_CLKFAIL(value)       (OSCCTRL_INTENSET_CLKFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_CLKFAIL_Pos)) /* Assignment of value for CLKFAIL in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLRDY_Pos          _UINT32_(8)                                          /* (OSCCTRL_INTENSET) DFLL Ready Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLRDY_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLRDY_Pos)      /* (OSCCTRL_INTENSET) DFLL Ready Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLRDY(value)       (OSCCTRL_INTENSET_DFLLRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLRDY_Pos)) /* Assignment of value for DFLLRDY in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLLOCK_Pos         _UINT32_(9)                                          /* (OSCCTRL_INTENSET) DFLL Lock Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLLOCK_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLLOCK_Pos)     /* (OSCCTRL_INTENSET) DFLL Lock Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLLOCK(value)      (OSCCTRL_INTENSET_DFLLLOCK_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLLOCK_Pos)) /* Assignment of value for DFLLLOCK in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLOVF_Pos          _UINT32_(10)                                         /* (OSCCTRL_INTENSET) DFLL Tuner Overflow Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLOVF_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLOVF_Pos)      /* (OSCCTRL_INTENSET) DFLL Tuner Overflow Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLOVF(value)       (OSCCTRL_INTENSET_DFLLOVF_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLOVF_Pos)) /* Assignment of value for DFLLOVF in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLUNF_Pos          _UINT32_(11)                                         /* (OSCCTRL_INTENSET) DFLL Tuner Underflow Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLUNF_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLUNF_Pos)      /* (OSCCTRL_INTENSET) DFLL Tuner Underflow Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLUNF(value)       (OSCCTRL_INTENSET_DFLLUNF_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLUNF_Pos)) /* Assignment of value for DFLLUNF in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLRCS_Pos          _UINT32_(12)                                         /* (OSCCTRL_INTENSET) DFLL Reference Clock Stopped Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLRCS_Msk          (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLRCS_Pos)      /* (OSCCTRL_INTENSET) DFLL Reference Clock Stopped Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLRCS(value)       (OSCCTRL_INTENSET_DFLLRCS_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLRCS_Pos)) /* Assignment of value for DFLLRCS in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_DFLLFAIL_Pos         _UINT32_(13)                                         /* (OSCCTRL_INTENSET) DFLL Startup Failure Interrupt Enable Position */
#define OSCCTRL_INTENSET_DFLLFAIL_Msk         (_UINT32_(0x1) << OSCCTRL_INTENSET_DFLLFAIL_Pos)     /* (OSCCTRL_INTENSET) DFLL Startup Failure Interrupt Enable Mask */
#define OSCCTRL_INTENSET_DFLLFAIL(value)      (OSCCTRL_INTENSET_DFLLFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_DFLLFAIL_Pos)) /* Assignment of value for DFLLFAIL in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_PLL0LOCKR_Pos        _UINT32_(24)                                         /* (OSCCTRL_INTENSET) PLL 0 Lock Rise Interrupt Enable Position */
#define OSCCTRL_INTENSET_PLL0LOCKR_Msk        (_UINT32_(0x1) << OSCCTRL_INTENSET_PLL0LOCKR_Pos)    /* (OSCCTRL_INTENSET) PLL 0 Lock Rise Interrupt Enable Mask */
#define OSCCTRL_INTENSET_PLL0LOCKR(value)     (OSCCTRL_INTENSET_PLL0LOCKR_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_PLL0LOCKR_Pos)) /* Assignment of value for PLL0LOCKR in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_PLL0LOCKF_Pos        _UINT32_(25)                                         /* (OSCCTRL_INTENSET) PLL 0 Lock Fall Interrupt Enable Position */
#define OSCCTRL_INTENSET_PLL0LOCKF_Msk        (_UINT32_(0x1) << OSCCTRL_INTENSET_PLL0LOCKF_Pos)    /* (OSCCTRL_INTENSET) PLL 0 Lock Fall Interrupt Enable Mask */
#define OSCCTRL_INTENSET_PLL0LOCKF(value)     (OSCCTRL_INTENSET_PLL0LOCKF_Msk & (_UINT32_(value) << OSCCTRL_INTENSET_PLL0LOCKF_Pos)) /* Assignment of value for PLL0LOCKF in the OSCCTRL_INTENSET register */
#define OSCCTRL_INTENSET_Msk                  _UINT32_(0x03003F07)                                 /* (OSCCTRL_INTENSET) Register Mask  */


/* -------- OSCCTRL_INTFLAG : (OSCCTRL Offset: 0x0C) (R/W 32) Interrupt Flag Status and Clear -------- */
#define OSCCTRL_INTFLAG_RESETVALUE            _UINT32_(0x00)                                       /*  (OSCCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

