Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00_secure/src/packs/PIC32CM5112SG00100_DFP/component/oscctrl.h
/* -------- OSCCTRL_XOSCCTRLA : (OSCCTRL Offset: 0x14) (R/W 32) External Multipurpose Crystal Oscillator Control A -------- */
#define OSCCTRL_XOSCCTRLA_RESETVALUE          _UINT32_(0xD00)                                      /*  (OSCCTRL_XOSCCTRLA) External Multipurpose Crystal Oscillator Control A  Reset Value */

#define OSCCTRL_XOSCCTRLA_ENABLE_Pos          _UINT32_(1)                                          /* (OSCCTRL_XOSCCTRLA) Oscillator Enable Position */
#define OSCCTRL_XOSCCTRLA_ENABLE_Msk          (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_ENABLE_Pos)      /* (OSCCTRL_XOSCCTRLA) Oscillator Enable Mask */
#define OSCCTRL_XOSCCTRLA_ENABLE(value)       (OSCCTRL_XOSCCTRLA_ENABLE_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_AGC_Pos             _UINT32_(2)                                          /* (OSCCTRL_XOSCCTRLA) Auto Gain Control Loop Enable Position */
#define OSCCTRL_XOSCCTRLA_AGC_Msk             (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_AGC_Pos)         /* (OSCCTRL_XOSCCTRLA) Auto Gain Control Loop Enable Mask */
#define OSCCTRL_XOSCCTRLA_AGC(value)          (OSCCTRL_XOSCCTRLA_AGC_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_AGC_Pos)) /* Assignment of value for AGC in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_XTALEN_Pos          _UINT32_(3)                                          /* (OSCCTRL_XOSCCTRLA) Crystal Oscillator Enable Position */
#define OSCCTRL_XOSCCTRLA_XTALEN_Msk          (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_XTALEN_Pos)      /* (OSCCTRL_XOSCCTRLA) Crystal Oscillator Enable Mask */
#define OSCCTRL_XOSCCTRLA_XTALEN(value)       (OSCCTRL_XOSCCTRLA_XTALEN_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_XTALEN_Pos)) /* Assignment of value for XTALEN in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_CFDEN_Pos           _UINT32_(4)                                          /* (OSCCTRL_XOSCCTRLA) Clock Failure Detector Enable Position */
#define OSCCTRL_XOSCCTRLA_CFDEN_Msk           (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_CFDEN_Pos)       /* (OSCCTRL_XOSCCTRLA) Clock Failure Detector Enable Mask */
#define OSCCTRL_XOSCCTRLA_CFDEN(value)        (OSCCTRL_XOSCCTRLA_CFDEN_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_CFDEN_Pos)) /* Assignment of value for CFDEN in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_SWBEN_Pos           _UINT32_(5)                                          /* (OSCCTRL_XOSCCTRLA) Xosc Clock Switch Back Enable Position */
#define OSCCTRL_XOSCCTRLA_SWBEN_Msk           (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_SWBEN_Pos)       /* (OSCCTRL_XOSCCTRLA) Xosc Clock Switch Back Enable Mask */
#define OSCCTRL_XOSCCTRLA_SWBEN(value)        (OSCCTRL_XOSCCTRLA_SWBEN_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_SWBEN_Pos)) /* Assignment of value for SWBEN in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_ONDEMAND_Pos        _UINT32_(7)                                          /* (OSCCTRL_XOSCCTRLA) On Demand Control Position */
#define OSCCTRL_XOSCCTRLA_ONDEMAND_Msk        (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_ONDEMAND_Pos)    /* (OSCCTRL_XOSCCTRLA) On Demand Control Mask */
#define OSCCTRL_XOSCCTRLA_ONDEMAND(value)     (OSCCTRL_XOSCCTRLA_ONDEMAND_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_ONDEMAND_Pos)) /* Assignment of value for ONDEMAND in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_STARTUP_Pos         _UINT32_(8)                                          /* (OSCCTRL_XOSCCTRLA) Start-Up Time Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_Msk         (_UINT32_(0xF) << OSCCTRL_XOSCCTRLA_STARTUP_Pos)     /* (OSCCTRL_XOSCCTRLA) Start-Up Time Mask */
#define OSCCTRL_XOSCCTRLA_STARTUP(value)      (OSCCTRL_XOSCCTRLA_STARTUP_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_STARTUP_Pos)) /* Assignment of value for STARTUP in the OSCCTRL_XOSCCTRLA register */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1_Val _UINT32_(0x0)                                        /* (OSCCTRL_XOSCCTRLA) 31 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2_Val _UINT32_(0x1)                                        /* (OSCCTRL_XOSCCTRLA) 61 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4_Val _UINT32_(0x2)                                        /* (OSCCTRL_XOSCCTRLA) 122 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8_Val _UINT32_(0x3)                                        /* (OSCCTRL_XOSCCTRLA) 244 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16_Val _UINT32_(0x4)                                        /* (OSCCTRL_XOSCCTRLA) 488 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32_Val _UINT32_(0x5)                                        /* (OSCCTRL_XOSCCTRLA) 977 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE64_Val _UINT32_(0x6)                                        /* (OSCCTRL_XOSCCTRLA) 1953 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE128_Val _UINT32_(0x7)                                        /* (OSCCTRL_XOSCCTRLA) 3906 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE256_Val _UINT32_(0x8)                                        /* (OSCCTRL_XOSCCTRLA) 7813 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE512_Val _UINT32_(0x9)                                        /* (OSCCTRL_XOSCCTRLA) 15625 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1024_Val _UINT32_(0xA)                                        /* (OSCCTRL_XOSCCTRLA) 31250 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2048_Val _UINT32_(0xB)                                        /* (OSCCTRL_XOSCCTRLA) 62500 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4096_Val _UINT32_(0xC)                                        /* (OSCCTRL_XOSCCTRLA) 125000 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8192_Val _UINT32_(0xD)                                        /* (OSCCTRL_XOSCCTRLA) 250000 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16384_Val _UINT32_(0xE)                                        /* (OSCCTRL_XOSCCTRLA) 500000 us  */
#define   OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32768_Val _UINT32_(0xF)                                        /* (OSCCTRL_XOSCCTRLA) 1000000 us  */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1      (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 31 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2      (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 61 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4      (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 122 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8      (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 244 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16     (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 488 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32     (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 977 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE64     (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE64_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 1953 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE128    (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE128_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 3906 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE256    (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE256_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 7813 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE512    (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE512_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 15625 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1024   (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE1024_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 31250 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2048   (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE2048_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 62500 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4096   (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE4096_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 125000 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8192   (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE8192_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 250000 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16384  (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE16384_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 500000 us Position */
#define OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32768  (OSCCTRL_XOSCCTRLA_STARTUP_CYCLE32768_Val << OSCCTRL_XOSCCTRLA_STARTUP_Pos) /* (OSCCTRL_XOSCCTRLA) 1000000 us Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_Pos        _UINT32_(16)                                         /* (OSCCTRL_XOSCCTRLA) Clock Failure Detector Prescaler Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_Msk        (_UINT32_(0xF) << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos)    /* (OSCCTRL_XOSCCTRLA) Clock Failure Detector Prescaler Mask */
#define OSCCTRL_XOSCCTRLA_CFDPRESC(value)     (OSCCTRL_XOSCCTRLA_CFDPRESC_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos)) /* Assignment of value for CFDPRESC in the OSCCTRL_XOSCCTRLA register */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV1_Val _UINT32_(0x0)                                        /* (OSCCTRL_XOSCCTRLA) 48 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV2_Val _UINT32_(0x1)                                        /* (OSCCTRL_XOSCCTRLA) 24 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV4_Val _UINT32_(0x2)                                        /* (OSCCTRL_XOSCCTRLA) 12 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV8_Val _UINT32_(0x3)                                        /* (OSCCTRL_XOSCCTRLA) 6 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV16_Val _UINT32_(0x4)                                        /* (OSCCTRL_XOSCCTRLA) 3 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV32_Val _UINT32_(0x5)                                        /* (OSCCTRL_XOSCCTRLA) 1.5 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV64_Val _UINT32_(0x6)                                        /* (OSCCTRL_XOSCCTRLA) 0.75 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV128_Val _UINT32_(0x7)                                        /* (OSCCTRL_XOSCCTRLA) 0.375 MHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV256_Val _UINT32_(0x8)                                        /* (OSCCTRL_XOSCCTRLA) 187.5 KHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV512_Val _UINT32_(0x9)                                        /* (OSCCTRL_XOSCCTRLA) 93.75 KHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV1024_Val _UINT32_(0xA)                                        /* (OSCCTRL_XOSCCTRLA) 46.875 KHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV2048_Val _UINT32_(0xB)                                        /* (OSCCTRL_XOSCCTRLA) 23.437 KHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV4096_Val _UINT32_(0xC)                                        /* (OSCCTRL_XOSCCTRLA) 11.718 KHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV8192_Val _UINT32_(0xD)                                        /* (OSCCTRL_XOSCCTRLA) 5.85 KHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV16384_Val _UINT32_(0xE)                                        /* (OSCCTRL_XOSCCTRLA) 2.92 KHz  */
#define   OSCCTRL_XOSCCTRLA_CFDPRESC_DIV32768_Val _UINT32_(0xF)                                        /* (OSCCTRL_XOSCCTRLA) 1.46 KHz  */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV1       (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV1_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 48 MHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV2       (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV2_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 24 MHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV4       (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV4_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 12 MHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV8       (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV8_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 6 MHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV16      (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV16_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 3 MHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV32      (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV32_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 1.5 MHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV64      (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV64_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 0.75 MHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV128     (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV128_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 0.375 MHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV256     (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV256_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 187.5 KHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV512     (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV512_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 93.75 KHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV1024    (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV1024_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 46.875 KHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV2048    (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV2048_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 23.437 KHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV4096    (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV4096_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 11.718 KHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV8192    (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV8192_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 5.85 KHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV16384   (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV16384_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 2.92 KHz Position */
#define OSCCTRL_XOSCCTRLA_CFDPRESC_DIV32768   (OSCCTRL_XOSCCTRLA_CFDPRESC_DIV32768_Val << OSCCTRL_XOSCCTRLA_CFDPRESC_Pos) /* (OSCCTRL_XOSCCTRLA) 1.46 KHz Position */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_Pos        _UINT32_(24)                                         /* (OSCCTRL_XOSCCTRLA) USBHS Referrence Clock Division Position */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_Msk        (_UINT32_(0x3) << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos)    /* (OSCCTRL_XOSCCTRLA) USBHS Referrence Clock Division Mask */
#define OSCCTRL_XOSCCTRLA_USBHSDIV(value)     (OSCCTRL_XOSCCTRLA_USBHSDIV_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos)) /* Assignment of value for USBHSDIV in the OSCCTRL_XOSCCTRLA register */
#define   OSCCTRL_XOSCCTRLA_USBHSDIV_DIS_Val  _UINT32_(0x0)                                        /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is disabled  */
#define   OSCCTRL_XOSCCTRLA_USBHSDIV_DIV1_Val _UINT32_(0x1)                                        /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 1  */
#define   OSCCTRL_XOSCCTRLA_USBHSDIV_DIV2_Val _UINT32_(0x2)                                        /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 2  */
#define   OSCCTRL_XOSCCTRLA_USBHSDIV_DIV4_Val _UINT32_(0x3)                                        /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 4  */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_DIS        (OSCCTRL_XOSCCTRLA_USBHSDIV_DIS_Val << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos) /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is disabled Position */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_DIV1       (OSCCTRL_XOSCCTRLA_USBHSDIV_DIV1_Val << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos) /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 1 Position */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_DIV2       (OSCCTRL_XOSCCTRLA_USBHSDIV_DIV2_Val << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos) /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 2 Position */
#define OSCCTRL_XOSCCTRLA_USBHSDIV_DIV4       (OSCCTRL_XOSCCTRLA_USBHSDIV_DIV4_Val << OSCCTRL_XOSCCTRLA_USBHSDIV_Pos) /* (OSCCTRL_XOSCCTRLA) USBHS PLL reference XOSC clock is divided by 4 Position */
#define OSCCTRL_XOSCCTRLA_WRTLOCK_Pos         _UINT32_(31)                                         /* (OSCCTRL_XOSCCTRLA) Write Lock for CTRLA register Position */
#define OSCCTRL_XOSCCTRLA_WRTLOCK_Msk         (_UINT32_(0x1) << OSCCTRL_XOSCCTRLA_WRTLOCK_Pos)     /* (OSCCTRL_XOSCCTRLA) Write Lock for CTRLA register Mask */
#define OSCCTRL_XOSCCTRLA_WRTLOCK(value)      (OSCCTRL_XOSCCTRLA_WRTLOCK_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLA_WRTLOCK_Pos)) /* Assignment of value for WRTLOCK in the OSCCTRL_XOSCCTRLA register */
#define OSCCTRL_XOSCCTRLA_Msk                 _UINT32_(0x830F0FBE)                                 /* (OSCCTRL_XOSCCTRLA) Register Mask  */


/* -------- OSCCTRL_XOSCCTRLB : (OSCCTRL Offset: 0x18) (R/W 32) External Multipurpose Crystal Oscillator Control B -------- */
#define OSCCTRL_XOSCCTRLB_RESETVALUE          _UINT32_(0x00)                                       /*  (OSCCTRL_XOSCCTRLB) External Multipurpose Crystal Oscillator Control B  Reset Value */

#define OSCCTRL_XOSCCTRLB_USRCFG_Pos          _UINT32_(0)                                          /* (OSCCTRL_XOSCCTRLB) User Configuration Control Bits Position */
#define OSCCTRL_XOSCCTRLB_USRCFG_Msk          (_UINT32_(0xFF) << OSCCTRL_XOSCCTRLB_USRCFG_Pos)     /* (OSCCTRL_XOSCCTRLB) User Configuration Control Bits Mask */
#define OSCCTRL_XOSCCTRLB_USRCFG(value)       (OSCCTRL_XOSCCTRLB_USRCFG_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLB_USRCFG_Pos)) /* Assignment of value for USRCFG in the OSCCTRL_XOSCCTRLB register */
#define OSCCTRL_XOSCCTRLB_WRTLOCK_Pos         _UINT32_(31)                                         /* (OSCCTRL_XOSCCTRLB) Write Lock for CTRLB register Position */
#define OSCCTRL_XOSCCTRLB_WRTLOCK_Msk         (_UINT32_(0x1) << OSCCTRL_XOSCCTRLB_WRTLOCK_Pos)     /* (OSCCTRL_XOSCCTRLB) Write Lock for CTRLB register Mask */
#define OSCCTRL_XOSCCTRLB_WRTLOCK(value)      (OSCCTRL_XOSCCTRLB_WRTLOCK_Msk & (_UINT32_(value) << OSCCTRL_XOSCCTRLB_WRTLOCK_Pos)) /* Assignment of value for WRTLOCK in the OSCCTRL_XOSCCTRLB register */
#define OSCCTRL_XOSCCTRLB_Msk                 _UINT32_(0x800000FF)                                 /* (OSCCTRL_XOSCCTRLB) Register Mask  */


/* -------- OSCCTRL_DFLLCTRLA : (OSCCTRL Offset: 0x2C) (R/W 32) DFLL48M Control A -------- */
#define OSCCTRL_DFLLCTRLA_RESETVALUE          _UINT32_(0x82)                                       /*  (OSCCTRL_DFLLCTRLA) DFLL48M Control A  Reset Value */

#define OSCCTRL_DFLLCTRLA_ENABLE_Pos          _UINT32_(1)                                          /* (OSCCTRL_DFLLCTRLA) DFLL Enable Position */
#define OSCCTRL_DFLLCTRLA_ENABLE_Msk          (_UINT32_(0x1) << OSCCTRL_DFLLCTRLA_ENABLE_Pos)      /* (OSCCTRL_DFLLCTRLA) DFLL Enable Mask */
#define OSCCTRL_DFLLCTRLA_ENABLE(value)       (OSCCTRL_DFLLCTRLA_ENABLE_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the OSCCTRL_DFLLCTRLA register */
#define OSCCTRL_DFLLCTRLA_WRTLOCK_Pos         _UINT32_(2)                                          /* (OSCCTRL_DFLLCTRLA) Write Lock Position */
#define OSCCTRL_DFLLCTRLA_WRTLOCK_Msk         (_UINT32_(0x1) << OSCCTRL_DFLLCTRLA_WRTLOCK_Pos)     /* (OSCCTRL_DFLLCTRLA) Write Lock Mask */
#define OSCCTRL_DFLLCTRLA_WRTLOCK(value)      (OSCCTRL_DFLLCTRLA_WRTLOCK_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLA_WRTLOCK_Pos)) /* Assignment of value for WRTLOCK in the OSCCTRL_DFLLCTRLA register */
#define OSCCTRL_DFLLCTRLA_LOWFREQ_Pos         _UINT32_(3)                                          /* (OSCCTRL_DFLLCTRLA) Low Frequency Mode Position */
#define OSCCTRL_DFLLCTRLA_LOWFREQ_Msk         (_UINT32_(0x1) << OSCCTRL_DFLLCTRLA_LOWFREQ_Pos)     /* (OSCCTRL_DFLLCTRLA) Low Frequency Mode Mask */
#define OSCCTRL_DFLLCTRLA_LOWFREQ(value)      (OSCCTRL_DFLLCTRLA_LOWFREQ_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLA_LOWFREQ_Pos)) /* Assignment of value for LOWFREQ in the OSCCTRL_DFLLCTRLA register */
#define OSCCTRL_DFLLCTRLA_ONDEMAND_Pos        _UINT32_(7)                                          /* (OSCCTRL_DFLLCTRLA) On Demand Control Position */
#define OSCCTRL_DFLLCTRLA_ONDEMAND_Msk        (_UINT32_(0x1) << OSCCTRL_DFLLCTRLA_ONDEMAND_Pos)    /* (OSCCTRL_DFLLCTRLA) On Demand Control Mask */
#define OSCCTRL_DFLLCTRLA_ONDEMAND(value)     (OSCCTRL_DFLLCTRLA_ONDEMAND_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLA_ONDEMAND_Pos)) /* Assignment of value for ONDEMAND in the OSCCTRL_DFLLCTRLA register */
#define OSCCTRL_DFLLCTRLA_Msk                 _UINT32_(0x0000008E)                                 /* (OSCCTRL_DFLLCTRLA) Register Mask  */


/* -------- OSCCTRL_DFLLCTRLB : (OSCCTRL Offset: 0x30) (R/W 32) DFLL48M Control B -------- */
#define OSCCTRL_DFLLCTRLB_RESETVALUE          _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLCTRLB) DFLL48M Control B  Reset Value */

