Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00_secure/src/packs/PIC32CM5112SG00100_DFP/component/oscctrl.h
#define OSCCTRL_DFLLCTRLB_LOOPEN_Pos          _UINT32_(0)                                          /* (OSCCTRL_DFLLCTRLB) Operating Mode Selection Position */
#define OSCCTRL_DFLLCTRLB_LOOPEN_Msk          (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_LOOPEN_Pos)      /* (OSCCTRL_DFLLCTRLB) Operating Mode Selection Mask */
#define OSCCTRL_DFLLCTRLB_LOOPEN(value)       (OSCCTRL_DFLLCTRLB_LOOPEN_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_LOOPEN_Pos)) /* Assignment of value for LOOPEN in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_STABLE_Pos          _UINT32_(1)                                          /* (OSCCTRL_DFLLCTRLB) Stable DFLL Frequency Position */
#define OSCCTRL_DFLLCTRLB_STABLE_Msk          (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_STABLE_Pos)      /* (OSCCTRL_DFLLCTRLB) Stable DFLL Frequency Mask */
#define OSCCTRL_DFLLCTRLB_STABLE(value)       (OSCCTRL_DFLLCTRLB_STABLE_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_STABLE_Pos)) /* Assignment of value for STABLE in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_LLAW_Pos            _UINT32_(2)                                          /* (OSCCTRL_DFLLCTRLB) Lose Lock After Wake Position */
#define OSCCTRL_DFLLCTRLB_LLAW_Msk            (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_LLAW_Pos)        /* (OSCCTRL_DFLLCTRLB) Lose Lock After Wake Mask */
#define OSCCTRL_DFLLCTRLB_LLAW(value)         (OSCCTRL_DFLLCTRLB_LLAW_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_LLAW_Pos)) /* Assignment of value for LLAW in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_USBCRM_Pos          _UINT32_(3)                                          /* (OSCCTRL_DFLLCTRLB) USB Clock Recovery Mode Position */
#define OSCCTRL_DFLLCTRLB_USBCRM_Msk          (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_USBCRM_Pos)      /* (OSCCTRL_DFLLCTRLB) USB Clock Recovery Mode Mask */
#define OSCCTRL_DFLLCTRLB_USBCRM(value)       (OSCCTRL_DFLLCTRLB_USBCRM_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_USBCRM_Pos)) /* Assignment of value for USBCRM in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_CCDIS_Pos           _UINT32_(4)                                          /* (OSCCTRL_DFLLCTRLB) Chill Cycle Disable Position */
#define OSCCTRL_DFLLCTRLB_CCDIS_Msk           (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_CCDIS_Pos)       /* (OSCCTRL_DFLLCTRLB) Chill Cycle Disable Mask */
#define OSCCTRL_DFLLCTRLB_CCDIS(value)        (OSCCTRL_DFLLCTRLB_CCDIS_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_CCDIS_Pos)) /* Assignment of value for CCDIS in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_QLDIS_Pos           _UINT32_(5)                                          /* (OSCCTRL_DFLLCTRLB) Quick Lock Disable Position */
#define OSCCTRL_DFLLCTRLB_QLDIS_Msk           (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_QLDIS_Pos)       /* (OSCCTRL_DFLLCTRLB) Quick Lock Disable Mask */
#define OSCCTRL_DFLLCTRLB_QLDIS(value)        (OSCCTRL_DFLLCTRLB_QLDIS_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_QLDIS_Pos)) /* Assignment of value for QLDIS in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_WAITLOCK_Pos        _UINT32_(7)                                          /* (OSCCTRL_DFLLCTRLB) Wait Lock Position */
#define OSCCTRL_DFLLCTRLB_WAITLOCK_Msk        (_UINT32_(0x1) << OSCCTRL_DFLLCTRLB_WAITLOCK_Pos)    /* (OSCCTRL_DFLLCTRLB) Wait Lock Mask */
#define OSCCTRL_DFLLCTRLB_WAITLOCK(value)     (OSCCTRL_DFLLCTRLB_WAITLOCK_Msk & (_UINT32_(value) << OSCCTRL_DFLLCTRLB_WAITLOCK_Pos)) /* Assignment of value for WAITLOCK in the OSCCTRL_DFLLCTRLB register */
#define OSCCTRL_DFLLCTRLB_Msk                 _UINT32_(0x000000BF)                                 /* (OSCCTRL_DFLLCTRLB) Register Mask  */


/* -------- OSCCTRL_DFLLTUNE : (OSCCTRL Offset: 0x34) (R/W 32) DFLL48M Tune -------- */
#define OSCCTRL_DFLLTUNE_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLTUNE) DFLL48M Tune  Reset Value */

#define OSCCTRL_DFLLTUNE_TUNE_Pos             _UINT32_(0)                                          /* (OSCCTRL_DFLLTUNE) Tune Value Position */
#define OSCCTRL_DFLLTUNE_TUNE_Msk             (_UINT32_(0x7F) << OSCCTRL_DFLLTUNE_TUNE_Pos)        /* (OSCCTRL_DFLLTUNE) Tune Value Mask */
#define OSCCTRL_DFLLTUNE_TUNE(value)          (OSCCTRL_DFLLTUNE_TUNE_Msk & (_UINT32_(value) << OSCCTRL_DFLLTUNE_TUNE_Pos)) /* Assignment of value for TUNE in the OSCCTRL_DFLLTUNE register */
#define OSCCTRL_DFLLTUNE_Msk                  _UINT32_(0x0000007F)                                 /* (OSCCTRL_DFLLTUNE) Register Mask  */


/* -------- OSCCTRL_DFLLDIFF : (OSCCTRL Offset: 0x38) ( R/ 32) DFLL48M Diff -------- */
#define OSCCTRL_DFLLDIFF_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLDIFF) DFLL48M Diff  Reset Value */

#define OSCCTRL_DFLLDIFF_DIFF_Pos             _UINT32_(0)                                          /* (OSCCTRL_DFLLDIFF) Multiplication Ratio Difference Position */
#define OSCCTRL_DFLLDIFF_DIFF_Msk             (_UINT32_(0xFFFF) << OSCCTRL_DFLLDIFF_DIFF_Pos)      /* (OSCCTRL_DFLLDIFF) Multiplication Ratio Difference Mask */
#define OSCCTRL_DFLLDIFF_DIFF(value)          (OSCCTRL_DFLLDIFF_DIFF_Msk & (_UINT32_(value) << OSCCTRL_DFLLDIFF_DIFF_Pos)) /* Assignment of value for DIFF in the OSCCTRL_DFLLDIFF register */
#define OSCCTRL_DFLLDIFF_Msk                  _UINT32_(0x0000FFFF)                                 /* (OSCCTRL_DFLLDIFF) Register Mask  */


/* -------- OSCCTRL_DFLLMUL : (OSCCTRL Offset: 0x3C) (R/W 32) DFLL48M Multiplier -------- */
#define OSCCTRL_DFLLMUL_RESETVALUE            _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLMUL) DFLL48M Multiplier  Reset Value */

#define OSCCTRL_DFLLMUL_MUL_Pos               _UINT32_(0)                                          /* (OSCCTRL_DFLLMUL) DFLL Multiply Factor Position */
#define OSCCTRL_DFLLMUL_MUL_Msk               (_UINT32_(0xFFFF) << OSCCTRL_DFLLMUL_MUL_Pos)        /* (OSCCTRL_DFLLMUL) DFLL Multiply Factor Mask */
#define OSCCTRL_DFLLMUL_MUL(value)            (OSCCTRL_DFLLMUL_MUL_Msk & (_UINT32_(value) << OSCCTRL_DFLLMUL_MUL_Pos)) /* Assignment of value for MUL in the OSCCTRL_DFLLMUL register */
#define OSCCTRL_DFLLMUL_STEP_Pos              _UINT32_(16)                                         /* (OSCCTRL_DFLLMUL) Tune Maximum Step Position */
#define OSCCTRL_DFLLMUL_STEP_Msk              (_UINT32_(0x7F) << OSCCTRL_DFLLMUL_STEP_Pos)         /* (OSCCTRL_DFLLMUL) Tune Maximum Step Mask */
#define OSCCTRL_DFLLMUL_STEP(value)           (OSCCTRL_DFLLMUL_STEP_Msk & (_UINT32_(value) << OSCCTRL_DFLLMUL_STEP_Pos)) /* Assignment of value for STEP in the OSCCTRL_DFLLMUL register */
#define OSCCTRL_DFLLMUL_Msk                   _UINT32_(0x007FFFFF)                                 /* (OSCCTRL_DFLLMUL) Register Mask  */


/* -------- OSCCTRL_PLL0CTRL : (OSCCTRL Offset: 0x40) (R/W 32) PLL Control -------- */
#define OSCCTRL_PLL0CTRL_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_PLL0CTRL) PLL Control  Reset Value */

#define OSCCTRL_PLL0CTRL_ENABLE_Pos           _UINT32_(1)                                          /* (OSCCTRL_PLL0CTRL) PLL Enable Position */
#define OSCCTRL_PLL0CTRL_ENABLE_Msk           (_UINT32_(0x1) << OSCCTRL_PLL0CTRL_ENABLE_Pos)       /* (OSCCTRL_PLL0CTRL) PLL Enable Mask */
#define OSCCTRL_PLL0CTRL_ENABLE(value)        (OSCCTRL_PLL0CTRL_ENABLE_Msk & (_UINT32_(value) << OSCCTRL_PLL0CTRL_ENABLE_Pos)) /* Assignment of value for ENABLE in the OSCCTRL_PLL0CTRL register */
#define OSCCTRL_PLL0CTRL_WRTLOCK_Pos          _UINT32_(2)                                          /* (OSCCTRL_PLL0CTRL) Write Lock Position */
#define OSCCTRL_PLL0CTRL_WRTLOCK_Msk          (_UINT32_(0x1) << OSCCTRL_PLL0CTRL_WRTLOCK_Pos)      /* (OSCCTRL_PLL0CTRL) Write Lock Mask */
#define OSCCTRL_PLL0CTRL_WRTLOCK(value)       (OSCCTRL_PLL0CTRL_WRTLOCK_Msk & (_UINT32_(value) << OSCCTRL_PLL0CTRL_WRTLOCK_Pos)) /* Assignment of value for WRTLOCK in the OSCCTRL_PLL0CTRL register */
#define OSCCTRL_PLL0CTRL_ONDEMAND_Pos         _UINT32_(7)                                          /* (OSCCTRL_PLL0CTRL) On Demand Control Position */
#define OSCCTRL_PLL0CTRL_ONDEMAND_Msk         (_UINT32_(0x1) << OSCCTRL_PLL0CTRL_ONDEMAND_Pos)     /* (OSCCTRL_PLL0CTRL) On Demand Control Mask */
#define OSCCTRL_PLL0CTRL_ONDEMAND(value)      (OSCCTRL_PLL0CTRL_ONDEMAND_Msk & (_UINT32_(value) << OSCCTRL_PLL0CTRL_ONDEMAND_Pos)) /* Assignment of value for ONDEMAND in the OSCCTRL_PLL0CTRL register */
#define OSCCTRL_PLL0CTRL_REFSEL_Pos           _UINT32_(8)                                          /* (OSCCTRL_PLL0CTRL) Reference selection Position */
#define OSCCTRL_PLL0CTRL_REFSEL_Msk           (_UINT32_(0x7) << OSCCTRL_PLL0CTRL_REFSEL_Pos)       /* (OSCCTRL_PLL0CTRL) Reference selection Mask */
#define OSCCTRL_PLL0CTRL_REFSEL(value)        (OSCCTRL_PLL0CTRL_REFSEL_Msk & (_UINT32_(value) << OSCCTRL_PLL0CTRL_REFSEL_Pos)) /* Assignment of value for REFSEL in the OSCCTRL_PLL0CTRL register */
#define   OSCCTRL_PLL0CTRL_REFSEL_GCLK_Val    _UINT32_(0x0)                                        /* (OSCCTRL_PLL0CTRL) Dedicated GCLK clock reference  */
#define   OSCCTRL_PLL0CTRL_REFSEL_XOSC_Val    _UINT32_(0x1)                                        /* (OSCCTRL_PLL0CTRL) XOSC clock reference  */
#define   OSCCTRL_PLL0CTRL_REFSEL_DFLL48M_Val _UINT32_(0x2)                                        /* (OSCCTRL_PLL0CTRL) DFLL48M clock reference  */
#define OSCCTRL_PLL0CTRL_REFSEL_GCLK          (OSCCTRL_PLL0CTRL_REFSEL_GCLK_Val << OSCCTRL_PLL0CTRL_REFSEL_Pos) /* (OSCCTRL_PLL0CTRL) Dedicated GCLK clock reference Position */
#define OSCCTRL_PLL0CTRL_REFSEL_XOSC          (OSCCTRL_PLL0CTRL_REFSEL_XOSC_Val << OSCCTRL_PLL0CTRL_REFSEL_Pos) /* (OSCCTRL_PLL0CTRL) XOSC clock reference Position */
#define OSCCTRL_PLL0CTRL_REFSEL_DFLL48M       (OSCCTRL_PLL0CTRL_REFSEL_DFLL48M_Val << OSCCTRL_PLL0CTRL_REFSEL_Pos) /* (OSCCTRL_PLL0CTRL) DFLL48M clock reference Position */
#define OSCCTRL_PLL0CTRL_BWSEL_Pos            _UINT32_(11)                                         /* (OSCCTRL_PLL0CTRL) Bandwidth selection Position */
#define OSCCTRL_PLL0CTRL_BWSEL_Msk            (_UINT32_(0x7) << OSCCTRL_PLL0CTRL_BWSEL_Pos)        /* (OSCCTRL_PLL0CTRL) Bandwidth selection Mask */
#define OSCCTRL_PLL0CTRL_BWSEL(value)         (OSCCTRL_PLL0CTRL_BWSEL_Msk & (_UINT32_(value) << OSCCTRL_PLL0CTRL_BWSEL_Pos)) /* Assignment of value for BWSEL in the OSCCTRL_PLL0CTRL register */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL0_Val   _UINT32_(0x0)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL1_Val   _UINT32_(0x1)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL2_Val   _UINT32_(0x2)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL3_Val   _UINT32_(0x3)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL4_Val   _UINT32_(0x4)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL5_Val   _UINT32_(0x5)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL6_Val   _UINT32_(0x6)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL7_Val   _UINT32_(0x7)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL0         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL0_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL1         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL1_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL2         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL2_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL3         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL3_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL4         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL4_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL5         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL5_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL6         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL6_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL7         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL7_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position */
#define OSCCTRL_PLL0CTRL_Msk                  _UINT32_(0x00003F86)                                 /* (OSCCTRL_PLL0CTRL) Register Mask  */


