Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00_secure/src/packs/PIC32CM5112SG00100_DFP/component/oscctrl.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* OSCCTRL register API structure */
typedef struct
{  /* Oscillators Control */
  __IO  uint32_t                       OSCCTRL_EVCTRL;     /* Offset: 0x00 (R/W  32) Event Control */
  __IO  uint32_t                       OSCCTRL_INTENCLR;   /* Offset: 0x04 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       OSCCTRL_INTENSET;   /* Offset: 0x08 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       OSCCTRL_INTFLAG;    /* Offset: 0x0C (R/W  32) Interrupt Flag Status and Clear */
  __I   uint32_t                       OSCCTRL_STATUS;     /* Offset: 0x10 (R/   32) Status */
  __IO  uint32_t                       OSCCTRL_XOSCCTRLA;  /* Offset: 0x14 (R/W  32) External Multipurpose Crystal Oscillator Control A */
  __IO  uint32_t                       OSCCTRL_XOSCCTRLB;  /* Offset: 0x18 (R/W  32) External Multipurpose Crystal Oscillator Control B */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       OSCCTRL_DFLLCTRLA;  /* Offset: 0x2C (R/W  32) DFLL48M Control A */
  __IO  uint32_t                       OSCCTRL_DFLLCTRLB;  /* Offset: 0x30 (R/W  32) DFLL48M Control B */
  __IO  uint32_t                       OSCCTRL_DFLLTUNE;   /* Offset: 0x34 (R/W  32) DFLL48M Tune */
  __I   uint32_t                       OSCCTRL_DFLLDIFF;   /* Offset: 0x38 (R/   32) DFLL48M Diff */
  __IO  uint32_t                       OSCCTRL_DFLLMUL;    /* Offset: 0x3C (R/W  32) DFLL48M Multiplier */
  __IO  uint32_t                       OSCCTRL_PLL0CTRL;   /* Offset: 0x40 (R/W  32) PLL Control */
  __IO  uint32_t                       OSCCTRL_PLL0FBDIV;  /* Offset: 0x44 (R/W  32) PLL Feed-Back Divider */
  __IO  uint32_t                       OSCCTRL_PLL0REFDIV; /* Offset: 0x48 (R/W  32) PLL reference divider */
  __IO  uint32_t                       OSCCTRL_PLL0POSTDIVA; /* Offset: 0x4C (R/W  32) PLL output clock divider A */
  __IO  uint32_t                       OSCCTRL_PLL0POSTDIVB; /* Offset: 0x50 (R/W  32) PLL output clock divider B */
  __I   uint8_t                        Reserved2[0x24];
  __I   uint32_t                       OSCCTRL_SYNCBUSY;   /* Offset: 0x78 (R/   32) Synchronization Busy */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       OSCCTRL_XOSCCAL;    /* Offset: 0x80 (R/W  32) XOSC Calibration Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       OSCCTRL_RC48MCAL0;  /* Offset: 0x88 (R/W  32) RC48M Calibration 0 */
} oscctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMSG00_OSCCTRL_COMPONENT_H_ */
